#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]
google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume]
google_firebase_project.default: Refreshing state... [id=projects/cloudresume-380001]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume/roles/storage.objectViewer/allUsers]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudresume-380001/global/backendBuckets/cloud-resume-backend-bucket]
google_compute_url_map.default: Refreshing state... [id=projects/cloudresume-380001/global/urlMaps/http-lb]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudresume-380001/global/forwardingRules/https-lb-forwarding-rule]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firebase_database_instance.default will be created
  + resource "google_firebase_database_instance" "default" {
      + database_url  = (known after apply)
      + desired_state = "ACTIVE"
      + id            = (known after apply)
      + instance_id   = "rtdb-project-default-rtdb"
      + name          = (known after apply)
      + project       = (known after apply)
      + region        = "us-central1"
      + state         = (known after apply)
      + type          = "DEFAULT_DATABASE"
    }

  # google_project_service.firebase_database will be created
  + resource "google_project_service" "firebase_database" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = (known after apply)
      + service            = "firebasedatabase.googleapis.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*